# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Downsample, [1024, 4]],
   [0, 1, Conv, [128, 3, 2]],    # 2-P2/4
   [-1, 3, C3, [128]],            # 3
   [-1, 1, Downsample, [1024, 3]],
   [3, 1, Conv, [256, 3, 2]],    # 5-P3/8
   [-1, 6, C3, [256]],            # 6
   [-1, 1, Downsample, [1024, 2]],
   [6, 1, Conv, [512, 3, 2]],    # 8-P4/16
   [-1, 9, C3, [512]],            # 9
   [-1, 1, Downsample, [1024, 1]],
   [9, 1, Conv, [1024, 3, 2]],   # 11-P5/32
   [[1, 4, 7, 10, 11], 1, Add_Bi, [5]],
   [-1, 3, C3, [1024]],           # 13
   [-1, 1, SPPF, [1024, 5]],      # 14
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                  # 13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 14
   [[-1, 9], 1, Concat, [1]],                   # 15 cat backbone P4
   [-1, 3, C3, [512, False]],                   # 16

   [-1, 1, Conv, [256, 1, 1]],                  # 17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 18
   [[-1, 6], 1, Concat, [1]],                   # 19 cat backbone P3
   [-1, 3, C3, [256, False]],                   # 20 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],  # 21
   [[-1, 18], 1, Concat, [1]],  # 22 cat head P4
   [-1, 3, C3, [512, False]],   # 23 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],  # 24
   [[-1, 14], 1, Concat, [1]],  # 25 cat head P5
   [-1, 3, C3, [1024, False]],  # 26 (P5/32-large)

   [[21, 24, 27], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
