# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [0, 1, Gap, [128]],            # 1
   [0, 1, Gap, [256]],            # 2
   [0, 1, Gap, [512]],            # 3
   [0, 1, Gap, [1024]],           # 4
   [0, 1, Conv, [128, 3, 2]],    # 5-P2/4
   [[-1, 1], 1, Add_weight, [2]],# 6
   [-1, 3, C3, [128]], # 7
   [-1, 1, Conv, [256, 3, 2]],    # 8-P3/8
   [[-1, 2], 1, Add_weight, [2]],# 9
   [-1, 6, C3, [256]],            # 10
   [-1, 1, Conv, [512, 3, 2]],    # 11-P4/16
   [[-1, 3], 1, Add_weight, [2]],# 12
   [-1, 9, C3, [512]],            # 13
   [-1, 1, Conv, [1024, 3, 2]],   # 14-P5/32
   [[-1, 4], 1, Add_weight, [2]],#15
   [-1, 3, C3, [1024]],           # 16
   [-1, 1, SPPF, [1024, 5]],      # 17
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                  # 18
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 19
   [[-1, 13], 1, Concat, [1]],                   # 20 cat backbone P4
   [-1, 3, C3, [512, False]],                   # 21

   [-1, 1, Conv, [256, 1, 1]],                  # 22
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 23
   [[-1, 10], 1, Concat, [1]],                   # 24 cat backbone P3
   [-1, 3, C3, [256, False]],                   # 25 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],  # 26
   [[-1, 22], 1, Concat, [1]],  # 27 cat head P4
   [-1, 3, C3, [512, False]],   # 28 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],  # 29
   [[-1, 18], 1, Concat, [1]],  # 30 cat head P5
   [-1, 3, C3, [1024, False]],  # 31 (P5/32-large)

   [[25, 28, 31], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]


