# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],     # 0-P1/2 320
   [-1, 1, Conv, [128, 3, 2]],       # 1-P2/4 160

   [-1, 1, DFConv1, [128, 3, 1]],     # 2
   [-1, 1, Conv, [128, 3, 2]],       # 3
   [1, 1, Conv, [128, 3, 2]],        # 4
   [-1, 3, C3, [128]],               # 5
   [[-1, 3], 1, Concat, [1]],        # 6-p3/8 80

   [-1, 1, DFConv1, [256, 3, 1]],     # 7
   [-1, 1, Conv, [256, 3, 2]],       # 8
   [6, 1, Conv, [256, 3, 2]],        # 9
   [-1, 6, C3, [256]],               # 10
   [[-1, 8], 1, Concat, [1]],        # 11-P4/16 40

   [-1, 1, DFConv1, [512, 3, 1]],     # 12
   [-1, 1, Conv, [512, 3, 2]],       # 13
   [11, 1, Conv, [256, 3, 2]],       # 14
   [-1, 9, C3, [512]],               # 15
   [[-1, 13], 1, Concat, [1]],       # 16-P5/32 20

   [-1, 3, C3, [1024]],              # 17
   [-1, 1, SPPF, [1024, 5]],         # 18
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                  # 19
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 20
   [[-1, 11], 1, Concat, [1]],                   # 21 cat backbone P4
   [-1, 3, C3, [512, False]],                   # 22

   [-1, 1, Conv, [256, 1, 1]],                  # 23
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 24
   [[-1, 6], 1, Concat, [1]],                   # 25 cat backbone P3
   [-1, 3, C3, [256, False]],                   # 26 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],        # 27
   [[-1, 23], 1, Concat, [1]],        # 28 cat head P4
   [-1, 3, C3, [512, False]],         # 29 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],        # 30
   [[-1, 19], 1, Concat, [1]],        # 31 cat head P5
   [-1, 3, C3, [1024, False]],        # 32 (P5/32-large)

   [[26, 29, 32], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
