# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# Add GAP from 320×320 to 4 heads

# Parameters
nc: 80  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, DSConv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, DSConv, [128, 3, 2]],    # 1
   [-1, 3, C3, [128]],              # 2-P2/4
   [-1, 1, DSConv, [256, 3, 2]],    # 3
   [-1, 6, C3DF, [256]],            # 4
   [3, 6, C3, [256]],               # 5-P3/8
   [-1, 1, DSConv, [512, 3, 2]],    # 6
   [-1, 9, C3DF, [512]],            # 7
   [6, 9, C3, [512]],               # 8-P4/16
   [-1, 1, DSConv, [1024, 3, 2]],   # 9
   [-1, 9, C3DF, [1024]],           # 10
   [9, 9, C3, [1024]],              # 11-P5/32
   [-1, 1, SPPF, [1024, 5]],        # 12
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [[-1, 1, DSConv, [512, 1, 1, 0]], # 13
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 14
   [[-1, 8], 1, Concat, [1]],       # 15 cat backbone P4
   [-1, 3, C3, [512, False]],       # 16

   [-1, 1, DSConv, [256, 1, 1, 0]], # 17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 18
   [[-1, 5], 1, Concat, [1]],       # 19 cat backbone P3
   [-1, 3, C3, [256, False]],       # 20 (P3/8-small)

   [-1, 1, DSConv, [128, 1, 1, 0]], # 21
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 22
   [[-1, 2], 1, Concat, [1]],       # 23 cat backbone P2
   [2, 1, Gap, [256]],# 24
   [[-1, 23], 1, Add, []],# 25
   [-1, 1, C3, [128, False]],       # 26 (P2/4-xsmall)

   [-1, 1, DSConv, [128, 3, 2]],    # 27
   [[-1, 21, 4], 1, Concat, [1]],   # 28 cat head P3
   [2, 1, Gap, [512]],# 29
   [[-1, 28], Sum, [2]],# 30
   [-1, 3, C3, [256, False]],       # 31 (P3/8-small)

   [-1, 1, DSConv, [256, 3, 2]],    # 32
   [[-1, 17, 7], 1, Concat, [1]],   # 33 cat head P4
   [2, 1, Gap, [1024]],# 34
   [[-1, 33], Sum, [2]],# 35
   [-1, 3, C3, [512, False]],       # 36 (P4/16-medium)

   [-1, 1, DSConv, [512, 3, 2]],    # 37
   [[-1, 13, 10], 1, Concat, [1]],  # 38 cat head P5
   [2, 1, Gap, [2048]],# 39
   [[-1, 38], Sum, [2]],# 40
   [-1, 3, C3, [1024, False]],      # 41 (P5/32-large)

   [[26, 31, 36, 41], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
