# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1 # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, ACBlock, [64, 6, 2, 2]],# 0
   [-1, 1, ACBlock, [64, 3, 1, 1, True]],  # 1-P1/2
   [-1, 1, ACBlock, [128, 3, 2, 1]],  # 2-P2/4
   [-1, 1, ACBlock, [128, 3, 1, 1, True]], # 3
   [-1, 3, C3, [128]],# 4
   [-1, 1, Pool, [256, 2]],# 5
   [-1, 1, ECA, [256]],# 6
   [-1, 1, Pool, [512, 2]],# 7
   [-1, 1, ECA, [512]],# 8
   [-1, 1, Pool, [1024, 2]],# 9
   [-1, 1, ECA, [1024]],# 10
   [4, 1, ACBlock, [256, 3, 2, 1]],  # 11-P3/8
   [-1, 1, ACBlock, [256, 3, 1, 1, True]],# 12
   [[-1, 6], 1, Concat, [1]],# 13
   [-1, 6, C3, [256]],# 14
   [-1, 1, ACBlock, [512, 3, 2, 1]],  # 15-P4/16
   [-1, 1, ACBlock, [512, 3, 1, 1, True]],# 16
   [[-1, 8], 1, Concat, [1]],# 17
   [-1, 9, C3, [512]],# 18
   [-1, 1, ACBlock, [1024, 3, 2, 1]],  # 19-P5/32
   [-1, 1, ACBlock, [1024, 3, 1, 1, True]],# 20
   [[-1, 10], 1, Concat, [1]],# 21
   [-1, 3, C3, [1024]],# 22
   [-1, 1, SPPF, [1024, 5]],  # 23
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],# 24
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 25
   [[-1, 18], 1, Concat, [1]],  # 26 cat backbone P4
   [-1, 3, C3, [512, False]],  # 27

   [-1, 1, Conv, [256, 1, 1]],# 28
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 29
   [[-1, 14], 1, Concat, [1]],  # 30 cat backbone P3
   [-1, 3, C3, [256, False]],  # 31 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],# 32
   [[-1, 28], 1, Concat, [1]],  # 33 cat head P4
   [-1, 3, C3, [512, False]],  # 34 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],# 35
   [[-1, 24], 1, Concat, [1]],  # 36 cat head P5
   [-1, 3, C3, [1024, False]],  # 37 (P5/32-large)

   [[31, 34, 37], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]