# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25 # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, DSConv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, ACBlock, [128, 3, 2, 1]],  # 1-P2/4
   [-1, 1, ACBlock, [128, 3, 1, 1, True]], # 2
   [-1, 3, C3, [128]],# 3
   [-1, 1, Pool, [256, 2]],# 4
   [-1, 1, ECA, [256]],# 5
   [-1, 1, Pool, [512, 2]],# 6
   [-1, 1, ECA, [512]],# 7
   [-1, 1, Pool, [1024, 2]],# 8
   [-1, 1, ECA, [1024]],# 9
   [3, 1, ACBlock, [256, 3, 2, 1]],  # 10-P3/8
   [-1, 1, ACBlock, [256, 3, 1, 1, True]],# 11
   [[-1, 5], 1, Concat, [1]],# 12
   [-1, 6, C3, [256]],# 13
   [-1, 1, ACBlock, [512, 3, 2, 1]],  # 14-P4/16
   [-1, 1, ACBlock, [512, 3, 1, 1, True]],# 15
   [[-1, 7], 1, Concat, [1]],# 16
   [-1, 9, C3, [512]],# 17
   [-1, 1, ACBlock, [1024, 3, 2, 1]],  # 18-P5/32
   [-1, 1, ACBlock, [1024, 3, 1, 1, True]],# 19
   [[-1, 9], 1, Concat, [1]],# 20
   [-1, 3, C3, [1024]],# 21
   [-1, 1, SPPF, [1024, 5]],  # 22
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, DSConv, [512, 1, 1, 0]],# 23
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 24
   [[-1, 17], 1, Concat, [1]],  # 25 cat backbone P4
   [-1, 3, C3, [512, False]],  # 26

   [-1, 1, DSConv, [256, 1, 1, 0]],# 27
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 28
   [[-1, 13], 1, Concat, [1]],  # 29 cat backbone P3
   [-1, 3, C3, [256, False]],  # 30 (P3/8-small)

   [-1, 1, ACBlock, [256, 3, 2, 1]],# 31
   [-1, 1, ACBlock, [256, 3, 1, 1, True]],# 32
   [[-1, 27], 1, Concat, [1]],  # 33 cat head P4
   [-1, 3, C3, [512, False]],  # 34 (P4/16-medium)

   [ -1, 1, ACBlock, [512, 3, 2, 1]],# 35
   [ -1, 1, ACBlock, [512, 3, 1, 1, True]],# 36
   [[-1, 23], 1, Concat, [1]],  # 37 cat head P5
   [-1, 3, C3, [1024, False]],  # 38 (P5/32-large)

   [[30, 34, 38], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]