# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25 # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, DSConv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, ACBlock, [128, 3, 2, 1]],  # 1-P2/4
   [-1, 1, ACBlock, [128, 3, 1, 1, True]], # 2
   [-1, 1, CoordAtt, [128]],# 3
   [-1, 3, C3, [128]],# 4
   [-1, 1, Pool, [256, 2]],# 5
   [-1, 1, CoordAtt, [256]],# 6
   [-1, 6, C3, [256]],# 7
   [-1, 1, Pool, [512, 2]],# 8
   [-1, 1, CoordAtt, [512]],# 9
   [-1, 9, C3, [512]],# 10
   [-1, 1, Pool, [1024, 2]],# 11
   [-1, 1, CoordAtt, [1024]],# 12
   [-1, 3, C3, [1024]],# 13
   [4, 1, ACBlock, [256, 3, 2, 1]],  # 14-P3/8
   [-1, 1, ACBlock, [256, 3, 1, 1, True]],# 15
   [[-1, 7], 1, Concat, [1]],# 16
   [-1, 1, CoordAtt, [512]],# 17
   [-1, 6, C3, [256]],# 18
   [-1, 1, ACBlock, [512, 3, 2, 1]],  # 19-P4/16
   [-1, 1, ACBlock, [512, 3, 1, 1, True]],# 20
   [[-1, 10], 1, Concat, [1]],# 21
   [-1, 1, CoordAtt, [1024]],# 22
   [-1, 9, C3, [512]],# 23
   [-1, 1, ACBlock, [1024, 3, 2, 1]],  # 24-P5/32
   [-1, 1, ACBlock, [1024, 3, 1, 1, True]],# 25
   [[-1, 13], 1, Concat, [1]],# 26
   [-1, 1, CoordAtt, [2048]],# 27
   [-1, 3, C3, [1024]],# 28
   [-1, 1, SPPF, [1024, 5]],  # 29
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, DSConv, [512, 1, 1, 0]],# 30
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 31
   [[-1, 23], 1, Concat, [1]],  # 32 cat backbone P4
   [-1, 3, C3, [512, False]],  # 33

   [-1, 1, DSConv, [256, 1, 1, 0]],# 34
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 35
   [[-1, 18], 1, Concat, [1]],  # 36 cat backbone P3
   [-1, 3, C3, [256, False]],  # 37 (P3/8-small)

   [-1, 1, ACBlock, [256, 3, 2, 1]],# 38
   [-1, 1, ACBlock, [256, 3, 1, 1, True]],# 39
   [[-1, 34], 1, Concat, [1]],  # 40 cat head P4
   [-1, 3, C3, [512, False]],  # 41 (P4/16-medium)

   [ -1, 1, ACBlock, [512, 3, 2, 1]],# 42
   [ -1, 1, ACBlock, [512, 3, 1, 1, True]],# 43
   [[-1, 30], 1, Concat, [1]],  # 44 cat head P5
   [-1, 3, C3, [1024, False]],  # 45 (P5/32-large)

   [[37, 41, 45], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]