# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [32,36, 34,86, 73,57]
  - [63,132, 123,102, 114,188]
  - [218,164, 148,320, 250,301]
  - [465,223, 334,440, 536,401]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, DSConv_A, [64, 6, 2, 2]], # 0   P1/2
   [-1, 1, DSConv_A, [128, 3, 1]],   # 1   P2/4
   [-1, 1, space_to_depth, [1]],
   [-1, 1, HRStage_SE, [128]],       # 3
   [-1, 1, DSConv_A, [256, 3, 1]],   # 4   P3/8
   [-1, 1, space_to_depth, [1]],
   [3, 1, HRStage_SE, [128]],        # 6
   [5, 1, HRStage_SE, [256]],        # 7

   [6, 1, Downsample, [256, 1]],     # 8   Start of first layer
   [6, 1, Downsample, [512, 2]],
   [7, 1, Upsample, [128, 1]],       # 10   Start of second layer
   [7, 1, DSConv_A, [512, 3, 1]],    #     P4/16
   [-1, 1, space_to_depth, [1]],
   [-1, 1, HRStage_SE, [512]],
   [[6, 10], 1, Add_Bi, [2]],         # 14  Combination start
   [[7, 8], 1, Add_Bi, [2]],
   [[9, 13], 1, Add_Bi, [2]],
   [14, 1, HRStage_SE, [128]],          # 17
   [15, 1, HRStage_SE, [256]],          # 18
   [16, 1, HRStage_SE, [512]],          # 19

   [17, 1, Downsample, [256, 1]],    # 20  Start of first layer
   [17, 1, Downsample, [512, 2]],
   [17, 1, Downsample, [1024, 3]],
   [18, 1, Upsample, [128, 1]],      # 23  Start of second layer
   [18, 1, Downsample, [512, 1]],
   [18, 1, Downsample, [1024, 2]],
   [19, 1, Upsample, [128, 2]],      # 26  Start of third layer
   [19, 1, Upsample, [256, 1]],
   [19, 1, DSConv_A, [1024, 3, 1]],  #     P5/32
   [-1, 1, space_to_depth, [1]],
   [-1, 1, HRStage_SE, [1024]],
   [[17, 23, 26], 1, Add_Bi, [3]],   # 31  Combination start
   [[18, 20, 27], 1, Add_Bi, [3]],   # 32
   [[19, 21, 24], 1, Add_Bi, [3]],   # 33
   [[22, 25, 30], 1, Add_Bi, [3]],   # 34
   [31, 1, HRStage_SE, [128]],       # 35
   [32, 1, HRStage_SE, [256]],       # 36
   [33, 1, HRStage_SE, [512]],       # 37
   [34, 3, C3CoaT, [1024]],          # 38

   [35, 1, Downsample, [256, 1]],    # 39  Start of first layer
   [35, 1, Downsample, [512, 2]],
   [35, 1, Downsample, [1024, 3]],
   [35, 1, Downsample, [2048, 4]],
   [36, 1, Upsample, [128, 1]],      # 43  Start of second layer
   [36, 1, Downsample, [512, 1]],
   [36, 1, Downsample, [1024, 2]],
   [36, 1, Downsample, [2048, 3]],
   [37, 1, Upsample, [128, 2]],      # 47  Start of third layer
   [37, 1, Upsample, [256, 1]],
   [37, 1, Downsample, [1024, 1]],
   [37, 1, Downsample, [2048, 2]],
   [38, 1, Upsample, [128, 3]],      # 51  Start of fourth layer
   [38, 1, Upsample, [256, 2]],
   [38, 1, Upsample, [512, 1]],
   [38, 1, DSConv_A, [2048, 3, 1]],
   [-1, 1, space_to_depth, [1]],
   [-1, 1, HRStage_SE, [2048]],
   [[35, 43, 47, 51], 1, Add_Bi, [4]],  # 57
   [[36, 39, 48, 52], 1, Add_Bi, [4]],
   [[37, 40, 44, 53], 1, Add_Bi, [4]],
   [[38, 41, 45, 49], 1, Add_Bi, [4]],
   [[42, 46, 50, 56], 1, Add_Bi, [4]],
   [57, 1, HRStage_SE, [128]],          # 62
   [58, 1, HRStage_SE, [256]],          # 63
   [59, 1, HRStage_SE, [512]],          # 64
   [60, 3, C3CoaT, [1024]],             # 65
   [61, 3, C3CoaT, [2048]],             # 66

   [62, 1, Downsample, [256, 1]],       # 67  Start of first layer
   [62, 1, Downsample, [512, 2]],
   [62, 1, Downsample, [1024, 3]],
   [63, 1, Upsample, [128, 1]],         # 70  Start of second layer
   [63, 1, Downsample, [512, 1]],
   [63, 1, Downsample, [1024, 2]],
   [64, 1, Upsample, [128, 2]],         # 73  Start of third layer
   [64, 1, Upsample, [256, 1]],
   [64, 1, Downsample, [1024, 1]],
   [65, 1, Upsample, [128, 3]],         # 76  Start of fourth layer
   [65, 1, Upsample, [256, 2]],
   [65, 1, Upsample, [512, 1]],
   [66, 1, Upsample, [128, 4]],         # 79 Start of fifth layer
   [66, 1, Upsample, [256, 3]],
   [66, 1, Upsample, [512, 2]],
   [66, 1, Upsample, [1024, 1]],
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [
   [[62, 70, 73, 76, 79], 1, Add_Bi, [5]],
   [-1, 1, HRStage_SE, [128, False]],             # 84
   [[63, 67, 74, 77, 80], 1, Add_Bi, [5]],
   [-1, 1, HRStage_SE, [256, False]],             # 86
   [[64, 68, 71, 78, 81], 1, Add_Bi, [5]],
   [-1, 1, HRStage_SE, [512, False]],             # 88
   [[65, 69, 72, 75, 82], 1, Add_Bi, [5]],
   [-1, 1, C3CoaT, [1024]],                       # 90
   [[84, 86, 88, 90], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
