# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [16, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [64, 3, 2]],    # 1-P2/4
   [-1, 3, C3, [64]],            # 2
   [-1, 1, Conv, [128, 3, 2]],    # 3-P3/8
   [-1, 6, C3, [128]],            # 4
   [-1, 1, Conv, [512, 3, 2]],    # 5-P4/16
   [-1, 9, C3, [512]],            # 6
   [-1, 1, Conv, [2048, 3, 2]],   # 7-P5/32
   [-1, 3, C3, [2048]],           # 8
   [-1, 1, SPPF, [2048, 5]],      # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, PixShuffle, [512, 2]],               # 10
   [[-1, 6], 1, Concat, [1]],                   # 11 cat backbone P4
   [-1, 3, C3, [512, False]],                   # 12

   [-1, 1, PixShuffle, [128, 2]],               # 13
   [[-1, 4], 1, Concat, [1]],                   # 14 cat backbone P3
   [-1, 3, C3, [128, False]],                   # 15 (P3/8-small)

   [-1, 1, PixShuffle, [512, 2, False]],        # 16
   [[-1, 10], 1, Concat, [1]],                  # 17 cat head P4
   [-1, 3, C3, [512, False]],                   # 18 (P4/16-medium)

   [-1, 1, PixShuffle, [2048, 2, False]],       # 19
   [[-1, 9], 1, Concat, [1]],                   # 20 cat head P5
   [-1, 3, C3, [2048, False]],                  # 21 (P5/32-large)

   [[15, 18, 21], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5)
  ]
