# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [32,36, 34,86, 73,57]
  - [63,132, 123,102, 114,188]
  - [218,164, 148,320, 250,301]
  - [465,223, 334,440, 536,401]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, DSConv_A, [64, 6, 2, 2]], # 0   P1/2
   [0, 1, Gap, [128]],               # 1
   [0, 1, Gap, [256]],               # 2
   [0, 1, Gap, [512]],               # 3
   [0, 1, Gap, [1024]],              # 4
   [0, 1, DSConv_A, [128, 3, 2]],    # 5   P2/4
   [-1, 1, HRStage_SE, [128]],       # 6
   [-1, 1, DSConv_A, [256, 3, 2]],   # 7   P3/8
   [5, 1, HRStage_SE, [128]],        # 8
   [7, 1, HRStage_SE, [256]],        # 9

   [8, 1, Downsample, [256, 1]],     # 10   Start of first layer
   [8, 1, Downsample, [512, 2]],
   [9, 1, Upsample, [128, 1]],       # 12   Start of second layer
   [9, 1, DSConv_A, [512, 3, 2]],    #     P4/16
   [[8, 12], 1, Add_Bi, [2]],        # 14  Combination start
   [[9, 10], 1, Add_Bi, [2]],
   [[11, 13], 1, Add_Bi, [2]],
   [14, 1, HRStage_SE, [128]],          # 17
   [15, 1, HRStage_SE, [256]],          # 18
   [16, 1, HRStage_SE, [512]],          # 19

   [17, 1, Downsample, [256, 1]],    # 20  Start of first layer
   [17, 1, Downsample, [512, 2]],
   [17, 1, Downsample, [1024, 3]],
   [18, 1, Upsample, [128, 1]],      # 23  Start of second layer
   [18, 1, Downsample, [512, 1]],
   [18, 1, Downsample, [1024, 2]],
   [19, 1, Upsample, [128, 2]],      # 26  Start of third layer
   [19, 1, Upsample, [256, 1]],
   [19, 1, DSConv_A, [1024, 3, 2]],  #     P5/32
   [[17, 23, 26], 1, Add_Bi, [3]],   # 29  Combination start
   [[18, 20, 27], 1, Add_Bi, [3]],   # 30
   [[19, 21, 24], 1, Add_Bi, [3]],   # 31
   [[22, 25, 28], 1, Add_Bi, [3]],   # 32
   [29, 1, HRStage_SE, [128]],       # 33
   [30, 1, HRStage_SE, [256]],       # 34
   [31, 1, HRStage_SE, [512]],       # 35
   [32, 3, C3CoaT, [1024]],          # 36

   [33, 1, Downsample, [256, 1]],    # 37  Start of first layer
   [33, 1, Downsample, [512, 2]],
   [33, 1, Downsample, [1024, 3]],
   [33, 1, Downsample, [2048, 4]],
   [34, 1, Upsample, [128, 1]],      # 41  Start of second layer
   [34, 1, Downsample, [512, 1]],
   [34, 1, Downsample, [1024, 2]],
   [34, 1, Downsample, [2048, 3]],
   [35, 1, Upsample, [128, 2]],      # 45  Start of third layer
   [35, 1, Upsample, [256, 1]],
   [35, 1, Downsample, [1024, 1]],
   [35, 1, Downsample, [2048, 2]],
   [36, 1, Upsample, [128, 3]],      # 49  Start of fourth layer
   [36, 1, Upsample, [256, 2]],
   [36, 1, Upsample, [512, 1]],
   [36, 1, DSConv_A, [2048, 3, 2]],
   [[33, 41, 45, 49], 1, Add_Bi, [4]],  # 53
   [[34, 37, 46, 50], 1, Add_Bi, [4]],
   [[35, 38, 42, 51], 1, Add_Bi, [4]],
   [[36, 39, 43, 47], 1, Add_Bi, [4]],
   [[40, 44, 48, 52], 1, Add_Bi, [4]],
   [53, 1, HRStage_SE, [128]],          # 58
   [54, 1, HRStage_SE, [256]],          # 59
   [55, 1, HRStage_SE, [512]],          # 60
   [56, 3, C3CoaT, [1024]],             # 61
   [57, 3, C3CoaT, [2048]],             # 62

   [58, 1, Downsample, [256, 1]],       # 63  Start of first layer
   [58, 1, Downsample, [512, 2]],
   [58, 1, Downsample, [1024, 3]],
   [59, 1, Upsample, [128, 1]],         # 66  Start of second layer
   [59, 1, Downsample, [512, 1]],
   [59, 1, Downsample, [1024, 2]],
   [60, 1, Upsample, [128, 2]],         # 69  Start of third layer
   [60, 1, Upsample, [256, 1]],
   [60, 1, Downsample, [1024, 1]],
   [61, 1, Upsample, [128, 3]],         # 72  Start of fourth layer
   [61, 1, Upsample, [256, 2]],
   [61, 1, Upsample, [512, 1]],
   [62, 1, Upsample, [128, 4]],         # 75 Start of fifth layer
   [62, 1, Upsample, [256, 3]],
   [62, 1, Upsample, [512, 2]],
   [62, 1, Upsample, [1024, 1]],
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [
   [[58, 66, 69, 72, 75], 1, Add_Bi, [5]],
   [-1, 1, HRStage_SE, [128, False]],
   [[-1, 1], 1, Add_weight, [2]],                 # 81
   [[59, 63, 70, 73, 76], 1, Add_Bi, [5]],
   [-1, 1, HRStage_SE, [256, False]],
   [[-1, 2], 1, Add_weight, [2]],                 # 84
   [[60, 64, 67, 74, 77], 1, Add_Bi, [5]],
   [-1, 1, HRStage_SE, [512, False]],
   [[-1, 3], 1, Add_weight, [2]],                 # 87
   [[61, 65, 68, 71, 78], 1, Add_Bi, [5]],
   [-1, 1, C3CoaT, [1024]],
   [[-1, 4], 1, Add_weight, [2]],                 # 90
   [[81, 84, 87, 90], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
