# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [32,36, 34,86, 73,57]
  - [63,132, 123,102, 114,188]
  - [218,164, 148,320, 250,301]
  - [465,223, 334,440, 536,401]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, DSConv_A, [64, 6, 2, 2]], # 0   P1/2
   [-1, 1, DSConv_A, [128, 3, 2]],   # 1   P2/4
   [-1, 1, HRStage_SE, [128]],       # 2
   [-1, 1, DSConv_A, [256, 3, 2]],   # 3   P3/8
   [2, 1, HRStage_SE, [128]],        # 4
   [3, 1, HRStage_SE, [256]],        # 5

   [4, 1, Downsample, [256, 1]],     # 6   Start of first layer
   [4, 1, Downsample, [512, 2]],
   [5, 1, Upsample, [128, 1]],       # 8   Start of second layer
   [5, 1, DSConv_A, [512, 3, 2]],    #     P4/16
   [[4, 8], 1, Add_Bi, [2]],         # 10  Combination start
   [[5, 6], 1, Add_Bi, [2]],
   [[7, 9], 1, Add_Bi, [2]],
   [10, 1, HRStage_SE, [128]],       # 13
   [11, 1, HRStage_SE, [256]],       # 14
   [12, 1, HRStage_SE, [512]],       # 15

   [13, 1, Downsample, [256, 1]],    # 16  Start of first layer
   [13, 1, Downsample, [512, 2]],
   [13, 1, Downsample, [1024, 3]],
   [14, 1, Upsample, [128, 1]],      # 19  Start of second layer
   [14, 1, Downsample, [512, 1]],
   [14, 1, Downsample, [1024, 2]],
   [15, 1, Upsample, [128, 2]],      # 22  Start of third layer
   [15, 1, Upsample, [256, 1]],
   [15, 1, DSConv_A, [1024, 3, 2]],  #     P5/32
   [[13, 19, 22], 1, Add_Bi, [3]],   # 25  Combination start
   [[14, 16, 23], 1, Add_Bi, [3]],   # 26
   [[15, 17, 20], 1, Add_Bi, [3]],   # 27
   [[18, 21, 24], 1, Add_Bi, [3]],   # 28
   [25, 1, HRStage_SE, [128]],
   [-1, 1, CoordAtt, [128]],         # 30
   [26, 1, HRStage_SE, [256]],
   [-1, 1, CoordAtt, [256]],         # 32
   [27, 1, HRStage_SE, [512]],
   [-1, 1, CoordAtt, [512]],         # 34
   [28, 3, C3CoaT, [1024]],
   [-1, 1, CoordAtt, [1024]],        # 36

   [30, 1, Downsample, [256, 1]],    # 37  Start of first layer
   [30, 1, Downsample, [512, 2]],
   [30, 1, Downsample, [1024, 3]],
   [32, 1, Upsample, [128, 1]],      # 40  Start of second layer
   [32, 1, Downsample, [512, 1]],
   [32, 1, Downsample, [1024, 2]],
   [34, 1, Upsample, [128, 2]],      # 43  Start of third layer
   [34, 1, Upsample, [256, 1]],
   [34, 1, Downsample, [1024, 1]],
   [36, 1, Upsample, [128, 3]],      # 46  Start of fourth layer
   [36, 1, Upsample, [256, 2]],
   [36, 1, Upsample, [512, 1]],
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [
   [[30, 40, 43, 46], 1, Add_Bi, [4]],
   [-1, 1, HRStage_SE, [128, False]],       # 50
   [[32, 37, 44, 47], 1, Add_Bi, [4]],
   [-1, 1, HRStage_SE, [256, False]],       # 52
   [[34, 38, 41, 48], 1, Add_Bi, [4]],
   [-1, 1, HRStage_SE, [512, False]],       # 54
   [[36, 39, 42, 45], 1, Add_Bi, [4]],
   [-1, 3, C3CoaT, [1024, False]],          # 56
   [[50, 52, 54, 56], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
