# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors: 3  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, DSConv, [64, 6, 2, 2]],  # 0-P1/2     320*320*64
   [-1, 1, DSConv, [128, 3, 2]],    # 1-P2/4     160*160*128
   [-1, 3, C3DS, [128]],            # 2          160*160*128
   [-1, 1, CoordAtt, [128]],      # 3          160*160*128
   [2, 1, DSConv, [256, 3, 2]],     # 4-P3/8     80*80*256
   [-1, 6, C3DS, [256]],            # 5          80*80*256
   [-1, 1, CoordAtt, [256]],      # 6          80*80*256
   [3, 1, Downsample, [128, 1]],  # 7          80*80*128
   [[-1, 6], 1, Concat, [1]],        # 8          80*80*384  *
   [6, 1, Upsample, [128, 1]],    # 9          160*160*128
   [[-1, 3], 1, Concat, [1]],        # 10         160*160*256 *
   [6, 1, DSConv, [512, 3, 2]],     # 11-P4/16   40*40*512
   [3, 1, Downsample, [128, 2]],  # 12         40*40*128
   [6, 1, Downsample, [256, 1]],  # 13         40*40*256
   [[-1, 12, 11], 1, Concat, [1]],   # 14         40*40*896  *
   [10, 3, C3DS, [128]],            # 15         160*160*128
   [-1, 1, CoordAtt, [128]],      # 16         160*160*128
   [8, 6, C3DS, [256]],             # 17         80*80*256
   [-1, 1, CoordAtt, [256]],      # 18         80*80*256
   [14, 9, C3DS, [512]],            # 19         40*40*512
   [-1, 1, CoordAtt, [512]],      # 20         40*40*512
   [16, 1, Downsample, [128, 1]],    # 21         80*80*128
   [16, 1, Downsample, [128, 2]],    # 22         40*40*128
   [16, 1, Downsample, [128, 3]],    # 23         20*20*128
   [18, 1, Upsample, [128, 1]],      # 24         160*160*128
   [18, 1, Downsample, [256, 1]],    # 25         40*40*256
   [18, 1, Downsample, [256, 2]],    # 26         20*20*256
   [20, 1, Upsample, [128, 2]],      # 27         160*160*128
   [20, 1, Upsample, [256, 1]],      # 28         80*80*256
   [20, 1, DSConv, [1024, 3, 2]],      # 29-P5/32   20*20*1024
   [[16, 24, 27], 1, Concat, [1]],# 30         160*160*384
   [[21, 18, 28], 1, Concat, [1]],# 31         80*80*640
   [[22, 25, 20], 1, Concat, [1]],# 32         40*40*896
   [[23, 26, 29], 1, Concat, [1]],# 33         20*20*1408
   [30, 3, C3DS, [128]],            # 34         160*160*128
   [-1, 1, CoordAtt, [128]],      # 35         160*160*128
   [31, 6, C3DS, [256]],            # 36         80*80*256
   [-1, 1, CoordAtt, [256]],      # 37         80*80*256
   [32, 9, C3DS, [512]],            # 38         40*40*512
   [-1, 1, CoordAtt, [512]],      # 39         40*40*512
   [33, 3, C3DS, [1024]],           # 40         20*20*1024
   [-1, 1, CoordAtt, [1024]],     # 41         20*20*1024
   [35, 1, Downsample, [128, 1]], # 42         80*80*128
   [35, 1, Downsample, [128, 2]], # 43         40*40*128
   [35, 1, Downsample, [128, 3]], # 44         20*20*128
   [37, 1, Upsample, [128, 1]],   # 45         160*160*128
   [37, 1, Downsample, [256, 1]], # 46         40*40*256
   [37, 1, Downsample, [256, 2]], # 47         20*20*256
   [39, 1, Upsample, [128, 2]],   # 48         160*160*128
   [39, 1, Upsample, [256, 1]],   # 49         80*80*256
   [39, 1, Downsample, [512, 1]], # 50         20*20*512
   [41, 1, Upsample, [128, 3]],   # 51         160*160*128
   [41, 1, Upsample, [256, 2]],   # 52         80*80*256
   [41, 1, Upsample, [512, 1]],   # 53         40*40*512

  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [
   [[35, 45, 48, 51], 1, Concat, [1]],# 54     160*160*512
   [-1, 3, C3DS, [512, False]], # 55
   [[42, 37, 49, 52], 1, Concat, [1]], # 56
   [-1, 3, C3DS, [896, False]], # 57
   [[43, 39, 46, 53], 1, Concat, [1]],# 58
   [-1, 3, C3DS, [1408, False]], # 59
   [[44, 47, 50, 41], 1, Concat, [1]],# 60
   [-1, 3, C3DS, [1920, False]], # 61
   [[55, 57, 59, 61], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
