# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25 # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, ACBlock, [128, 3, 2]],  # 1-P2/4
   [-1, 1, ACBlock, [128, 3, 1, True]], # 2
   [-1, 1, ECA, [128]],# 3
   [-1, 3, C3, [128]],# 4
   [-1, 1, Pool, [1024, 8]],# 5
   [-1, 1, ECA, [1024]],# 6
   [-1, 3, C3, [1024]],# 7
   [3, 1, Pool, [512, 4]],# 8
   [-1, 1, ECA, [512]],# 9
   [-1, 3, C3, [512]],# 10
   [3, 1, Pool, [256, 2]],# 11
   [-1, 1, ECA, [256]],# 12
   [-1, 3, C3, [256]],# 13
   [3, 1, ACBlock, [256, 3, 2]],  # 14-P3/8
   [-1, 1, ACBlock, [256, 3, 1, True]],# 15
   [[-1, 13], 1, Concat, [1]],# 16
   [-1, 6, C3, [256]],# 17
   [-1, 1, ACBlock, [512, 3, 2]],  # 18-P4/16
   [-1, 1, ACBlock, [512, 3, 1, True]],# 19
   [[-1, 10], 1, Concat, [1]],# 20
   [-1, 9, C3, [512]],# 21
   [-1, 1, ACBlock, [1024, 3, 2]],  # 22-P5/32
   [-1, 1, ACBlock, [1024, 3, 1, True]],# 23
   [[-1, 7], 1, Concat, [1]],# 24
   [-1, 3, C3, [1024]],# 25
   [-1, 1, SPPF, [1024, 5]],  # 26
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],# 27
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 28
   [[-1, 21], 1, Concat, [1]],  # 29 cat backbone P4
   [-1, 3, C3, [512, False]],  # 30

   [-1, 1, Conv, [256, 1, 1]],# 31
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 32
   [[-1, 17], 1, Concat, [1]],  # 33 cat backbone P3
   [-1, 3, C3, [256, False]],  # 34 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],# 35
   [[-1, 31], 1, Concat, [1]],  # 36 cat head P4
   [-1, 3, C3, [512, False]],  # 37 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],# 38
   [[-1, 27], 1, Concat, [1]],  # 39 cat head P5
   [-1, 3, C3, [1024, False]],  # 40 (P5/32-large)

   [[34, 37, 40], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
