# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]
  - [98,154, 191,122, 129,263]  # P3/8
  - [232,200, 209,346, 498,197]  # P4/16
  - [356,311, 352,495, 542,399]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, DSConv, [64, 6, 2, 2]],  # 0-P1/2     320*320*64
   [-1, 1, DSConv, [128, 3, 2]],    # 1-P2/4     160*160*128
   [-1, 1, C3, [128]],            # 2          160*160*128
   [-1, 1, CoordAtt, [128]],      # 3          160*160*128
   [-1, 1, DSConv, [256, 3, 2]],    # 4-P3/8     80*80*256
   [3, 1, C3, [128]],             # 5          160*160*128
   [-1, 1, CoordAtt, [128]],      # 6          160*160*128
   [4, 3, C3, [256]],             # 7          80*80*256
   [-1, 1, CoordAtt, [256]],      # 8          80*80*256

   [6, 1, Downsample, [256, 1]],   # 9          80*80*256
   [6, 1, Downsample, [512, 2]],  # 10         40*40*512
   [8, 1, Upsample, [128, 1]],    # 11         160*160*128
   [8, 1, DSConv, [512, 3, 2]],     # 12-P4/16   40*40*512
   [[6, 11], 1, Add_weight, [2]],     # 13         160*160*128
   [[8, 9], 1, Add_weight, [2]],      # 14         80*80*256
   [[10, 12], 1, Add_weight, [2]],    # 15         40*40*512
   [13, 1, C3, [128]],            # 16         160*160*128
   [-1, 1, CoordAtt, [128]],      # 17         160*160*128
   [14, 3, C3, [256]],            # 18         80*80*256
   [-1, 1, CoordAtt, [256]],      # 19         80*80*256
   [15, 6, C3, [512]],            # 20         40*40*512
   [-1, 1, CoordAtt, [512]],      # 21         40*40*512

   [17, 1, Downsample, [256, 1]],    # 22         80*80*256
   [17, 1, Downsample, [512, 2]],    # 23         40*40*512
   [17, 1, Downsample, [1024, 3]],   # 24         20*20*1024
   [19, 1, Upsample, [128, 1]],      # 25         160*160*128
   [19, 1, Downsample, [512, 1]],    # 26         40*40*512
   [19, 1, Downsample, [1024, 2]],   # 27         20*20*1024
   [21, 1, Upsample, [128, 2]],      # 28         160*160*128
   [21, 1, Upsample, [256, 1]],      # 29         80*80*256
   [21, 1, DSConv, [1024, 3, 2]],      # 30-P5/32   20*20*1024
   [[17, 25, 28], 1, Add_weight, [3]],   # 31         160*160*128
   [[19, 22, 29], 1, Add_weight, [3]],   # 32         80*80*256
   [[21, 23, 26], 1, Add_weight, [3]],   # 33         40*40*512
   [[24, 27, 30], 1, Add_weight, [3]],   # 34         20*20*1024
   [31, 3, C3, [128]],            # 35         160*160*128
   [-1, 1, CoordAtt, [128]],      # 36         160*160*128
   [32, 3, C3, [256]],            # 37         80*80*256
   [-1, 1, CoordAtt, [256]],      # 38         80*80*256
   [33, 9, C3, [512]],            # 39         40*40*512
   [-1, 1, CoordAtt, [512]],      # 40         40*40*512
   [34, 3, C3, [1024]],           # 41         20*20*1024
   [-1, 1, CoordAtt, [1024]],     # 42         20*20*1024

   [36, 1, Downsample, [256, 1]], # 43         80*80*256
   [36, 1, Downsample, [512, 2]], # 44         40*40*512
   [36, 1, Downsample, [1024, 3]], # 45         20*20*1024
   [38, 1, Upsample, [128, 1]],   # 46         160*160*128
   [38, 1, Downsample, [512, 1]], # 47         40*40*256
   [38, 1, Downsample, [1024, 2]], # 48         20*20*1024
   [40, 1, Upsample, [128, 2]],   # 49         160*160*128
   [40, 1, Upsample, [256, 1]],   # 50         80*80*256
   [40, 1, Downsample, [1024, 1]], # 51         20*20*1024
   [42, 1, Upsample, [128, 3]],   # 52         160*160*128
   [42, 1, Upsample, [256, 2]],   # 53         80*80*256
   [42, 1, Upsample, [512, 1]],   # 54         40*40*512
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [
   [[36, 46, 49, 52], 1, Add_weight, [4]],# 55     160*160*512
   [-1, 3, C3, [128, False]], # 56
   [[38, 43, 50, 53], 1, Add_weight, [4]], # 57
   [-1, 3, C3, [256, False]], # 58
   [[40, 44, 47, 54], 1, Add_weight, [4]],# 59
   [-1, 3, C3, [512, False]], # 60
   [[42, 45, 48, 51], 1, Add_weight, [4]],# 61
   [-1, 3, C3, [1024, False]], # 62
   [[56, 58, 60, 62], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
