# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25 # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, ACBlocks, [128]],  # 1-P2/4
   [-1, 3, C3DF, [128]],# 2
   [-1, 1, PoolECA, [256, 2]],# 3
   [-1, 6, C3DF, [256]],# 4
   [-1, 1, PoolECA, [512, 2]],# 5
   [-1, 9, C3DF, [512]],# 6
   [-1, 1, PoolECA, [1024, 2]],# 7
   [-1, 3, C3DF, [1024]],# 8
   [2, 1, ACBlocks, [256]],  # 9-P3/8
   [[-1, 4], 1, Concat, [1]],# 10
   [-1, 6, C3DF, [256]],# 11
   [-1, 1, ACBlocks, [512]],  # 12-P4/16
   [[-1, 6], 1, Concat, [1]],# 13
   [-1, 9, C3DF, [512]],# 14
   [-1, 1, ACBlocks, [1024]],  # 15-P5/32
   [[-1, 8], 1, Concat, [1]],# 16
   [-1, 3, C3DF, [1024]],# 17
   [-1, 1, SPPF, [1024, 5]],  # 18
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],# 19
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 20
   [[-1, 14], 1, Concat, [1]],  # 21 cat backbone P4
   [-1, 3, C3DF, [512, False]],  # 22

   [-1, 1, Conv, [256, 1, 1, 0]],# 23
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],# 24
   [[-1, 11], 1, Concat, [1]],  # 25 cat backbone P3
   [-1, 3, C3DF, [256, False]],  # 26 (P3/8-small)

   [-1, 1, ACBlocks, [256]],# 27
   [[-1, 23], 1, Concat, [1]],  # 28 cat head P4
   [-1, 3, C3DF, [512, False]],  # 29 (P4/16-medium)

   [ -1, 1, ACBlocks, [512]],# 30
   [[-1, 19], 1, Concat, [1]],  # 31 cat head P5
   [-1, 3, C3DF, [1024, False]],  # 32 (P5/32-large)

   [[26, 29, 32], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]