# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [32,36, 34,86, 73,57]
  - [63,132, 123,102, 114,188]
  - [218,164, 148,320, 250,301]
  - [465,223, 334,440, 536,401]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, DSConv_A, [64, 6, 2, 2]], # 0   P1/2
   [-1, 1, DSConv_A, [128, 3, 2]],   # 1   P2/4
   [-1, 1, HRStage_SE, [128]],       # 2
   [-1, 1, DSConv_A, [256, 3, 2]],   # 3   P3/8
   [2, 1, HRStage_SE, [128]],           # 4
   [3, 1, HRStage_SE, [256]],           # 5

   [4, 1, Downsample, [256, 1]],     # 6   Start of first layer
   [-1, 1, Downsample, [512, 1]],
   [5, 1, Upsample, [128, 1]],       # 8   Start of second layer
   [5, 1, DSConv_A, [512, 3, 2]],    #     P4/16
   [[4, 8], 1, Add_weight, [2]],         # 10  Combination start
   [[5, 6], 1, Add_weight, [2]],
   [[7, 9], 1, Add_weight, [2]],
   [10, 1, HRStage_SE, [128]],          # 13
   [11, 1, HRStage_SE, [256]],          # 14
   [12, 1, HRStage_SE_LK, [512]],          # 15

   [13, 1, Downsample, [256, 1]],    # 16  Start of first layer
   [-1, 1, Downsample, [512, 1]],
   [-1, 1, Downsample, [1024, 1]],
   [14, 1, Upsample, [128, 1]],      # 19  Start of second layer
   [14, 1, Downsample, [512, 1]],
   [-1, 1, Downsample, [1024, 1]],
   [15, 1, Upsample, [256, 1]],      # 22  Start of third layer
   [-1, 1, Upsample, [128, 1]],
   [15, 1, DSConv_A, [1024, 3, 2]],  #     P5/32
   [[13, 19, 23], 1, Add_weight, [3]],   # 25  Combination start
   [[14, 16, 22], 1, Add_weight, [3]],   # 26
   [[15, 17, 20], 1, Add_weight, [3]],   # 27
   [[18, 21, 24], 1, Add_weight, [3]],   # 28
   [25, 1, HRStage_SE, [128]],           # 29
   [26, 1, HRStage_SE, [256]],           # 30
   [27, 1, HRStage_SE_LK, [512]],        # 31
   [28, 1, HRStage_SE_LK, [1024]],       # 32

   [29, 1, Downsample, [256, 1]],    # 33  Start of first layer
   [-1, 1, Downsample, [512, 1]],
   [-1, 1, Downsample, [1024, 1]],
   [-1, 1, Downsample, [2048, 1]],
   [30, 1, Upsample, [128, 1]],      # 37  Start of second layer
   [30, 1, Downsample, [512, 1]],
   [-1, 1, Downsample, [1024, 1]],
   [-1, 1, Downsample, [2048, 1]],
   [31, 1, Upsample, [256, 1]],      # 41  Start of third layer
   [-1, 1, Upsample, [128, 1]],
   [31, 1, Downsample, [1024, 1]],
   [-1, 1, Downsample, [2048, 1]],
   [32, 1, Upsample, [512, 1]],      # 45  Start of fourth layer
   [-1, 1, Upsample, [256, 1]],
   [-1, 1, Upsample, [128, 1]],
   [32, 1, DSConv_A, [2048, 3, 2]],

   [[29, 37, 42, 47], 1, Add_weight, [4]],  # 49
   [[30, 33, 41, 46], 1, Add_weight, [4]],
   [[31, 34, 38, 45], 1, Add_weight, [4]],
   [[32, 35, 39, 43], 1, Add_weight, [4]],
   [[36, 40, 44, 48], 1, Add_weight, [4]],
   [49, 1, HRStage_SE, [128]],          # 54
   [50, 1, HRStage_SE, [256]],          # 55
   [51, 1, HRStage_SE_LK, [512]],       # 56
   [52, 1, HRStage_SE_LK, [1024]],      # 57
   [53, 9, C3BoT, [2048]],             # 58

   [54, 1, Downsample, [256, 1]],       # 59  Start of first layer
   [-1, 1, Downsample, [512, 1]],
   [-1, 1, Downsample, [1024, 1]],
   [55, 1, Upsample, [128, 1]],         # 62  Start of second layer
   [55, 1, Downsample, [512, 1]],
   [-1, 1, Downsample, [1024, 1]],
   [56, 1, Upsample, [256, 1]],         # 65  Start of third layer
   [-1, 1, Upsample, [128, 1]],
   [56, 1, Downsample, [1024, 1]],
   [57, 1, Upsample, [512, 1]],         # 68  Start of fourth layer
   [-1, 1, Upsample, [256, 1]],
   [-1, 1, Upsample, [128, 1]],
   [58, 1, Upsample, [1024, 1]],        # 71 Start of fifth layer
   [-1, 1, Upsample, [512, 1]],
   [-1, 1, Upsample, [256, 1]],
   [-1, 1, Upsample, [128, 1]],
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [
   [[54, 62, 66, 70, 74], 1, Add_weight, [5]],
   [-1, 6, C3, [128, False]],             # 76
   [[55, 59, 65, 69, 73], 1, Add_weight, [5]],
   [-1, 6, C3, [256, False]],             # 78
   [[56, 60, 63, 68, 72], 1, Add_weight, [5]],
   [-1, 6, C3, [512, False]],             # 80
   [[57, 61, 64, 67, 71], 1, Add_weight, [5]],
   [-1, 6, C3, [1024, False]],                       # 82
   [[76, 78, 80, 82], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
